suresh569/https-github.com-zephyrproject-rtos-zephyr/include/zephyr/dt-bindings/interrupt-controller/r7fa4m1xxxxxx-events.h
/*
 * Copyright (c) 2023 TOKITA Hiroshi <tokita.hiroshi@fujitsu.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DT_BINDINGS_INTERRUPT_CONTROLLER_R7FA4M1XXXXXX_EVENTS_H_
#define ZEPHYR_DT_BINDINGS_INTERRUPT_CONTROLLER_R7FA4M1XXXXXX_EVENTS_H_

#include <zephyr/dt-bindings/interrupt-controller/renesas-ra-icu.h>

#define RA_ICU_PORT_IRQ0       (0x01 << 8)
#define RA_ICU_PORT_IRQ1       (0x02 << 8)
#define RA_ICU_PORT_IRQ2       (0x03 << 8)
#define RA_ICU_PORT_IRQ3       (0x04 << 8)
#define RA_ICU_PORT_IRQ4       (0x05 << 8)
#define RA_ICU_PORT_IRQ5       (0x06 << 8)
#define RA_ICU_PORT_IRQ6       (0x07 << 8)
#define RA_ICU_PORT_IRQ7       (0x08 << 8)
#define RA_ICU_PORT_IRQ8       (0x09 << 8)
#define RA_ICU_PORT_IRQ9       (0x0A << 8)
#define RA_ICU_PORT_IRQ10      (0x0B << 8)
#define RA_ICU_PORT_IRQ11      (0x0C << 8)
#define RA_ICU_PORT_IRQ12      (0x0D << 8)
#define RA_ICU_PORT_IRQ14      (0x0F << 8)
#define RA_ICU_PORT_IRQ15      (0x10 << 8)
#define RA_ICU_DMAC0_INT       (0x11 << 8)
#define RA_ICU_DMAC1_INT       (0x12 << 8)
#define RA_ICU_DMAC2_INT       (0x13 << 8)
#define RA_ICU_DMAC3_INT       (0x14 << 8)
#define RA_ICU_DTC_COMPLETE    (0x15 << 8)

#define RA_ICU_ICU_SNZCANCEL   (0x17 << 8)
#define RA_ICU_FCU_FRDYI       (0x18 << 8)
#define RA_ICU_LVD_LVD1        (0x19 << 8)
#define RA_ICU_LVD_LVD2        (0x1A << 8)
#define RA_ICU_VBATT_LVD       (0x1B << 8)
#define RA_ICU_MOSC_STOP       (0x1C << 8)
#define RA_ICU_SYSTEM_SNZREQ   (0x1D << 8)
#define RA_ICU_AGT0_AGTI       (0x1E << 8)
#define RA_ICU_AGT0_AGTCMAI    (0x1F << 8)
#define RA_ICU_AGT0_AGTCMBI    (0x20 << 8)
#define RA_ICU_AGT1_AGTI       (0x21 << 8)
#define RA_ICU_AGT1_AGTCMAI    (0x22 << 8)
#define RA_ICU_AGT1_AGTCMBI    (0x23 << 8)
#define RA_ICU_IWDT_NMIUNDF    (0x24 << 8)
#define RA_ICU_WDT_NMIUNDF     (0x25 << 8)
#define RA_ICU_RTC_ALM         (0x26 << 8)
#define RA_ICU_RTC_PRD         (0x27 << 8)
#define RA_ICU_RTC_CUP         (0x28 << 8)
#define RA_ICU_ADC140_ADI      (0x29 << 8)
#define RA_ICU_ADC140_GBADI    (0x2A << 8)
#define RA_ICU_ADC140_CMPAI    (0x2B << 8)
#define RA_ICU_ADC140_CMPBI    (0x2C << 8)
#define RA_ICU_ADC140_WCMPM    (0x2D << 8)
#define RA_ICU_ADC140_WCMPUM   (0x2E << 8)
#define RA_ICU_ACMP_LP0        (0x2F << 8)
#define RA_ICU_ACMP_LP1        (0x30 << 8)
#define RA_ICU_USBFS_D0FIFO    (0x31 << 8)
#define RA_ICU_USBFS_D1FIFO    (0x32 << 8)
#define RA_ICU_USBFS_USBI      (0x33 << 8)
#define RA_ICU_USBFS_USBR      (0x34 << 8)
#define RA_ICU_IIC0_RXI        (0x35 << 8)
#define RA_ICU_IIC0_TXI        (0x36 << 8)
#define RA_ICU_IIC0_TEI        (0x37 << 8)
#define RA_ICU_IIC0_EEI        (0x38 << 8)
#define RA_ICU_IIC0_WUI        (0x39 << 8)
#define RA_ICU_IIC1_RXI        (0x3A << 8)
#define RA_ICU_IIC1_TXI        (0x3B << 8)
#define RA_ICU_IIC1_TEI        (0x3C << 8)
#define RA_ICU_IIC1_EEI        (0x3D << 8)
#define RA_ICU_SSIE0_SSITXI    (0x3E << 8)
#define RA_ICU_SSIE0_SSIRXI    (0x3F << 8)

#define RA_ICU_SSIE0_SSIF      (0x41 << 8)
#define RA_ICU_CTSU_CTSUWR     (0x42 << 8)
#define RA_ICU_CTSU_CTSURD     (0x43 << 8)
#define RA_ICU_CTSU_CTSUFN     (0x44 << 8)
#define RA_ICU_KEY_INTKR       (0x45 << 8)
#define RA_ICU_DOC_DOPCI       (0x46 << 8)
#define RA_ICU_CAC_FERRI       (0x47 << 8)
#define RA_ICU_CAC_MENDI       (0x48 << 8)
#define RA_ICU_CAC_OVFI        (0x49 << 8)
#define RA_ICU_CAN0_ERS        (0x4A << 8)
#define RA_ICU_CAN0_RXF        (0x4B << 8)
#define RA_ICU_CAN0_TXF        (0x4C << 8)
#define RA_ICU_CAN0_RXM        (0x4D << 8)
#define RA_ICU_CAN0_TXM        (0x4E << 8)
#define RA_ICU_IOPORT_GROUP1   (0x46 << 8)
#define RA_ICU_IOPORT_GROUP2   (0x50 << 8)
#define RA_ICU_IOPORT_GROUP3   (0x51 << 8)
#define RA_ICU_IOPORT_GROUP4   (0x52 << 8)
#define RA_ICU_ELC_SWEVT0      (0x53 << 8)
#define RA_ICU_ELC_SWEVT1      (0x54 << 8)
#define RA_ICU_POEG_GROUP0     (0x55 << 8)
#define RA_ICU_POEG_GROUP1     (0x56 << 8)
#define RA_ICU_GPT0_CCMPA      (0x57 << 8)
#define RA_ICU_GPT0_CCMPB      (0x58 << 8)
#define RA_ICU_GPT0_CMPC       (0x59 << 8)
#define RA_ICU_GPT0_CMPD       (0x5A << 8)
#define RA_ICU_GPT0_CMPE       (0x5B << 8)
#define RA_ICU_GPT0_CMPF       (0x5C << 8)
#define RA_ICU_GPT0_OVF        (0x5D << 8)
#define RA_ICU_GPT0_UDF        (0x5E << 8)
#define RA_ICU_GPT1_CCMPA      (0x5F << 8)
#define RA_ICU_GPT1_CCMPB      (0x60 << 8)
#define RA_ICU_GPT1_CMPC       (0x61 << 8)
#define RA_ICU_GPT1_CMPD       (0x62 << 8)
#define RA_ICU_GPT1_CMPE       (0x63 << 8)
#define RA_ICU_GPT1_CMPF       (0x64 << 8)
#define RA_ICU_GPT1_OVF        (0x65 << 8)
#define RA_ICU_GPT1_UDF        (0x66 << 8)
#define RA_ICU_GPT2_CCMPA      (0x67 << 8)
#define RA_ICU_GPT2_CCMPB      (0x68 << 8)
#define RA_ICU_GPT2_CMPC       (0x69 << 8)
#define RA_ICU_GPT2_CMPD       (0x6A << 8)
#define RA_ICU_GPT2_CMPE       (0x6B << 8)
#define RA_ICU_GPT2_CMPF       (0x6C << 8)
#define RA_ICU_GPT2_OVF        (0x6D << 8)
#define RA_ICU_GPT2_UDF        (0x6E << 8)
#define RA_ICU_GPT3_CCMPA      (0x6F << 8)
#define RA_ICU_GPT3_CCMPB      (0x70 << 8)
#define RA_ICU_GPT3_CMPC       (0x71 << 8)
#define RA_ICU_GPT3_CMPD       (0x72 << 8)
#define RA_ICU_GPT3_CMPE       (0x73 << 8)
#define RA_ICU_GPT3_CMPF       (0x74 << 8)
#define RA_ICU_GPT3_OVF        (0x75 << 8)
#define RA_ICU_GPT3_UDF        (0x76 << 8)
#define RA_ICU_GPT4_CCMPA      (0x77 << 8)
#define RA_ICU_GPT4_CCMPB      (0x78 << 8)
#define RA_ICU_GPT4_CMPC       (0x79 << 8)
#define RA_ICU_GPT4_CMPD       (0x7A << 8)
#define RA_ICU_GPT4_CMPE       (0x7B << 8)
#define RA_ICU_GPT4_CMPF       (0x7C << 8)
#define RA_ICU_GPT4_OVF        (0x7D << 8)
#define RA_ICU_GPT4_UDF        (0x7E << 8)
#define RA_ICU_GPT5_CCMPA      (0x7F << 8)
#define RA_ICU_GPT5_CCMPB      (0x80 << 8)
#define RA_ICU_GPT5_CMPC       (0x81 << 8)
#define RA_ICU_GPT5_CMPD       (0x82 << 8)
#define RA_ICU_GPT5_CMPE       (0x83 << 8)
#define RA_ICU_GPT5_CMPF       (0x84 << 8)
#define RA_ICU_GPT5_OVF        (0x85 << 8)
#define RA_ICU_GPT5_UDF        (0x86 << 8)
#define RA_ICU_GPT6_CCMPA      (0x87 << 8)
#define RA_ICU_GPT6_CCMPB      (0x88 << 8)
#define RA_ICU_GPT6_CMPC       (0x89 << 8)
#define RA_ICU_GPT6_CMPD       (0x8A << 8)
#define RA_ICU_GPT6_CMPE       (0x8B << 8)
#define RA_ICU_GPT6_CMPF       (0x8C << 8)
#define RA_ICU_GPT6_OVF        (0x8D << 8)
#define RA_ICU_GPT6_UDF        (0x8E << 8)
#define RA_ICU_GPT7_CCMPA      (0x8F << 8)
#define RA_ICU_GPT7_CCMPB      (0x90 << 8)
#define RA_ICU_GPT7_CMPC       (0x91 << 8)
#define RA_ICU_GPT7_CMPD       (0x92 << 8)
#define RA_ICU_GPT7_CMPE       (0x93 << 8)
#define RA_ICU_GPT7_CMPF       (0x94 << 8)
#define RA_ICU_GPT7_OVF        (0x95 << 8)
#define RA_ICU_GPT7_UDF        (0x96 << 8)
#define RA_ICU_GPT_UVWEDGE     (0x97 << 8)
#define RA_ICU_SCI0_RXI        (0x98 << 8)
#define RA_ICU_SCI0_TXI        (0x99 << 8)
#define RA_ICU_SCI0_TEI        (0x9A << 8)
#define RA_ICU_SCI0_ERI        (0x9B << 8)
#define RA_ICU_SCI0_AM         (0x9C << 8)
#define RA_ICU_SCI0_RXI_OR_ERI (0x9D << 8)
#define RA_ICU_SCI1_RXI        (0x9E << 8)
#define RA_ICU_SCI1_TXI        (0x9F << 8)
#define RA_ICU_SCI1_TEI        (0xA0 << 8)
#define RA_ICU_SCI1_ERI        (0xA1 << 8)
#define RA_ICU_SCI1_AM         (0xA2 << 8)
#define RA_ICU_SCI2_RXI        (0xA3 << 8)
#define RA_ICU_SCI2_TXI        (0xA4 << 8)
#define RA_ICU_SCI2_TEI        (0xA5 << 8)
#define RA_ICU_SCI2_ERI        (0xA6 << 8)
#define RA_ICU_SCI2_AM         (0xA7 << 8)
#define RA_ICU_SCI9_RXI        (0xA8 << 8)
#define RA_ICU_SCI9_TXI        (0xA9 << 8)
#define RA_ICU_SCI9_TEI        (0xAA << 8)
#define RA_ICU_SCI9_ERI        (0xAB << 8)
#define RA_ICU_SCI9_AM         (0xAC << 8)
#define RA_ICU_SPI0_SPRI       (0xAD << 8)
#define RA_ICU_SPI0_SPTI       (0xAE << 8)
#define RA_ICU_SPI0_SPII       (0xAF << 8)
#define RA_ICU_SPI0_SPEI       (0xB0 << 8)
#define RA_ICU_SPI0_SPTEND     (0xB1 << 8)
#define RA_ICU_SPI1_SPRI       (0xB2 << 8)
#define RA_ICU_SPI1_SPTI       (0xB3 << 8)
#define RA_ICU_SPI1_SPII       (0xB4 << 8)
#define RA_ICU_SPI1_SPEI       (0xB5 << 8)
#define RA_ICU_SPI1_SPTEND     (0xB6 << 8)

#endif /* ZEPHYR_DT_BINDINGS_INTERRUPT_CONTROLLER_R7FA4M1XXXXXX_EVENTS_H_ */
